using System.Text;

using static EventsExample.DaysCounter;
 
namespace EventsExample

{

    /* події сигналізують системі про те, що сталася певна подія.

    якщо потрібно відстежити ці дії, то події якраз дозволяють це зробити.
 
    https://metanit.com/sharp/tutorial/3.14.php
 
    події в .net базуються на моделі делегата. модель делегата відповідає

    шаблону розробки спостерігача, який дозволяє підписнику зареєструватися у постачальника

    і отримувати від нього сповіщення. відправник події надсилає сповіщення про подію,

    а приймач події отримує сповіщення і визначає відповідь на нього.
 
    подія — це повідомлення, надіслане об'єктом, щоб повідомити про вчинення дії.

    ця дія може бути викликана взаємодією користувача, наприклад натисканням кнопки,

    або іншою програмною логікою, наприклад зміною значення властивості.
 
    об'єкт, що викликає подію, називається відправником подій.

    відправнику подій невідомий об'єкт чи метод, який отримуватиме (оброблятиме)

    створені ним події. зазвичай подія є компонентом відправника подій;

    наприклад, подія click — компонент класу button, а подія propertychanged — компонент класу,

    що реалізує інтерфейс inotifypropertychanged.
 
    щоб визначити подію, в c# необхідно використовувати ключове слово event.

    */
 
    class DaysCounter // клас-видавець, в якому проводиться підрахунок

    {

        public delegate void MyEventHandler(); // тип делегата, який задає сигнатуру методів-обробників події
 
        // подія PayRent з типом делегата MyEventHandler

        public event MyEventHandler? PayRent; // назва події (чорний день місяця, коли треба платити оренду)
 
        public void StartCounting()

        {

            for (int i = 1; i <= 31; i++)

            {

                Console.Write(i + ", ");

                if (i == 5) // колись я платив кожного 18го числа... нащастя, тепер я живу в своєму домі

                {

                    Console.WriteLine("\n");

                    if (PayRent != null) // якщо є хоч один підписник на подію (адже комусь має бути цікаво настання цієї дати, наприклад власнику квартири)

                        PayRent(); // генерація події класом-видавцем

                }

            }

        }

    }
 
    class Oleksandr // клас-підписник, що реагує на подію (коли настав 25-й день місяця) записом рядка в консоль

    {

        double money = 12500;

        double happiness = 89; 

        public void LoseMoney() // метод оплати оренди за квартиру

        {

            Console.WriteLine("Олександр каже: Сьогодні найсумніший день у місяці...");

            money -= 8000;

            happiness -= 50;

        }

    }
 
    class LandLady // ще один клас-підписник (господиня квартири)

    {

        public event MyEventHandler? CelebrateGoodDay;
 
        public void GetPaid()

        {

            if (CelebrateGoodDay != null)

            {

                CelebrateGoodDay(); // подія на подію

            }

            Console.WriteLine("Кіра (не Найтлі): Юхуху! Нарешті цей день настав!!\n");

        }
 
        public void BuyChehol()

        {

            Console.WriteLine("Ура! В мене є зайві 8 тисяч гривень! Можна купити собі новий чехол для смартфона зі стразіками!\n");

        }

    }
 
    class Program

    {

        static void Main()

        {

            Console.OutputEncoding = Encoding.UTF8;
 
            var counter = new DaysCounter(); // екземпляр класу-видавця

            var alex = new Oleksandr(); // екземпляр класу-підписника

            var kira = new LandLady(); // ще один екземпляр класу-підписника
 
            // counter.StartCounting(); // краще не запускати підрахунок, поки немає підписників!
 
            kira.CelebrateGoodDay += kira.BuyChehol;

            counter.PayRent += kira.GetPaid;

 
            counter.StartCounting();
 
        }

    }

}
C# и .NET | События
События в c#, их объявление с помощью ключевого слова event и использование на примере, прикрепление обработчиков событий и их удаление
 
